; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p6---int100n150-m25---int100c110---s35---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level16 level16)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level16 level17)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level16 level18)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level16 level19)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level16 level20)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level16 level21)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level16 level22)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level16 level23)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level16 level24)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level16 level25)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level16 level26)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level16 level27)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level16 level28)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level16 level29)
(sum level14 level1 level15)
(sum level14 level16 level30)
(sum level15 level1 level16)
(sum level15 level16 level31)
(sum level16 level1 level17)
(sum level16 level16 level32)
(sum level17 level1 level18)
(sum level17 level16 level33)
(sum level18 level1 level19)
(sum level18 level16 level34)
(sum level19 level1 level20)
(sum level19 level16 level35)
(sum level20 level1 level21)
(sum level20 level16 level36)
(sum level21 level1 level22)
(sum level21 level16 level37)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)
(sum level25 level1 level26)
(sum level26 level1 level27)
(sum level27 level1 level28)
(sum level28 level1 level29)
(sum level29 level1 level30)
(sum level30 level1 level31)
(sum level31 level1 level32)
(sum level32 level1 level33)
(sum level33 level1 level34)
(sum level34 level1 level35)
(sum level35 level1 level36)
(sum level36 level1 level37)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)

(at t0 l2)
(fuel t0 level37)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l2)
(at p4 l0)
(at p5 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 6
2. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 6
3. (drive t0 l2 l0 level21 level16 level37)
   deleted: (at t0 l2) (fuel t0 level37)
   added: (at t0 l0) (fuel t0 level21)
   goals met: 0 of 6
4. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 1 of 6
5. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 2 of 6
6. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 2 of 6
7. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 6
8. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 2 of 6
9. (drive t0 l0 l1 level20 level1 level21)
   deleted: (at t0 l0) (fuel t0 level21)
   added: (at t0 l1) (fuel t0 level20)
   goals met: 2 of 6
10. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 2 of 6
11. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 6
12. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 6
13. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 5 of 6
14. (drive t0 l1 l0 level19 level1 level20)
   deleted: (at t0 l1) (fuel t0 level20)
   added: (at t0 l0) (fuel t0 level19)
   goals met: 5 of 6
15. (drive t0 l0 l2 level3 level16 level19)
   deleted: (at t0 l0) (fuel t0 level19)
   added: (at t0 l2) (fuel t0 level3)
   goals met: 5 of 6
16. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 6 of 6
